package com.nickuli.nucleotide.chap1basis;
/**Создайте класс, который описывает вектор (в трёхмерном пространстве).

 У него должны быть:

 конструктор с параметрами в виде списка координат x, y, z
 метод, вычисляющий длину вектора.
 метод, вычисляющий скалярное произведение
 метод, вычисляющий векторное произведение с другим вектором
 метод, вычисляющий угол между векторами (или косинус угла)
 методы для суммы и разности
 статический метод, который принимает целое число N, и возвращает массив случайных векторов размером N.

 Если метод возвращает вектор, то он должен возвращать новый объект, а не менять базовый.
 То есть, нужно реализовать шаблон "Неизменяемый объект".
 */
public class Vector {
    public static void main(String[] args) {

    }
}
